<a href="https://colab.research.google.com/github/sisterme3/Data_Science/blob/master/NB11_Assign3_NashvilleHousing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Suppose you are planning to purchase a home in Nashville in the near future. You would like to determine the best place to consider buying based upon your budget restrictions and space needs ... as well as distance to work and other possible factors.

In [0]:
! git clone https://github.com/acreeg/NashvilleHousingData.git

Cloning into 'NashvilleHousingData'...
remote: Enumerating objects: 9, done.
remote: Counting objects: 100% (9/9), done.
remote: Compressing objects: 100% (9/9), done.
remote: Total 9 (delta 3), reused 0 (delta 0), pack-reused 0
Unpacking objects: 100% (9/9), done.

Import packages, read data into dataframes, reassign column names

In [0]:
#import the pandas package for data analytics
# and matplotlib for visualizations
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Read the data files into pandas dataframes .
# Notice that we must indicate the full path of the data file.
houses_2017 = pd.read_csv('NashvilleHousingData/2017SINGLEFAMILYSF.txt')

# Alter the column names in each of the new dataframes
houses_2017.columns = ['APN', 'DistrictCode', 'CouncilDistrict', 'AddressFullAddress',
       'AddressCity', 'AddressPostalCode', 'LAND', 'IMPR', 'TOTALAPPR',
       'TOTALASSD', 'FinishedArea']

### Before we dig into the Nashville/Davidson Housing Data, let's take a look at some of the python/pandas details that will help us to work with the data in a way that will be most helpful.

Let's build a dataframe from scratch. 

We will first create several lists, that will become the columns of our dataframe.

In [0]:
# imports
import pandas as pd

# Create the lists
names = ['Bob', 'Susan', 'Greg', 'Corey', 'Abbey', 'Nora']
salary = [85657, 56220, 75879, 35447, 123541, 77869]
years_employed = [5,8,3,6,16,2]
age = [35,48,32,51,45,26]

# Create a dictionary from the lists
# Note: a dictionary is a sequence of key:value pairs ...
# where the key provides the name/id, and the value provides the data/object
data = {'Names': names, 'Salary': salary, 'YearsEmployed': years_employed, 'Age': age}

# Create a pandas dataframe built upon the dictionary named 'data' created above.
NewDataFrame = pd.DataFrame(data)
NewDataFrame

   Names  Salary  YearsEmployed  Age
0    Bob   85657              5   35
1  Susan   56220              8   48
2   Greg   75879              3   32
3  Corey   35447              6   51
4  Abbey  123541             16   45
5   Nora   77869              2   26

### Create a new column in NewDataFrame called 'YearsToRetirement' by subtracting the 'Age' column from 67.

In [0]:
NewDataFrame['YearsToRetirement']= 67 - NewDataFrame['Age']
NewDataFrame

   Names  Salary  YearsEmployed  Age  YearsToRetirement
0    Bob   85657              5   35                 32
1  Susan   56220              8   48                 19
2   Greg   75879              3   32                 35
3  Corey   35447              6   51                 16
4  Abbey  123541             16   45                 22
5   Nora   77869              2   26                 41

### Restrict the dataframe to only those people that earn more than $36000 

Call the new dataframe restrictDF

In [0]:
# Create your dataframe here.
restrictDF = NewDataFrame[NewDataFrame['Salary'] > 36000]

# View the dataframe
restrictDF

   Names  Salary  YearsEmployed  Age  YearsToRetirement
0    Bob   85657              5   35                 32
1  Susan   56220              8   48                 19
2   Greg   75879              3   32                 35
4  Abbey  123541             16   45                 22
5   Nora   77869              2   26                 41

Further restrict the restrictDF dataframe to only the people that earn less than $100,000
Note: Rather than starting with NewDataFrame, begin with the newly created restrictDF and simply make additional restrictions.

In [0]:
# Create your dataframe here.
restrictDF = restrictDF[restrictDF['Salary'] < 100000]

# Use .shape to determine the # of rows and columns in the dataframe.
restrictDF.shape

(4, 5)

Note that we can combine the two restrictions in the previous cells by using the '&' symbol to represent AND in the following way:

In [0]:
# Create your dataframe here.
restrictDF = NewDataFrame[(NewDataFrame['Salary'] < 100000) & (NewDataFrame['Salary'] > 36000)]

# View the dataframe
restrictDF

   Names  Salary  YearsEmployed  Age  YearsToRetirement
0    Bob   85657              5   35                 32
1  Susan   56220              8   48                 19
2   Greg   75879              3   32                 35
5   Nora   77869              2   26                 41

In the cell below, write the code that will create a dataframe (restrictDF) that includes only those people with salaries between \$36,000 and \$100,000 ... and with more than 2 years on the job.

In [0]:
# Create your dataframe here.
restrictDF = NewDataFrame[(NewDataFrame['Salary'] < 100000) & (NewDataFrame['Salary'] > 36000) & (NewDataFrame['YearsEmployed'] > 2)]

# View the dataframe
restrictDF

   Names  Salary  YearsEmployed  Age  YearsToRetirement
0    Bob   85657              5   35                 32
1  Susan   56220              8   48                 19
2   Greg   75879              3   32                 35

### Now let's move back to the Nashville Housing data. You have a budget/target of \$150K-$200K to spend on a house with a need for at least 1800 sq ft of living space.

In [0]:
# As a reminder, let's take a look at the head of the dataframe
houses_2017.head()

              APN DistrictCode  ...  TOTALASSD FinishedArea
0  103020C01300CO         USD   ...      19840        567.0
1  103020C01400CO         USD   ...      13750        567.0
2  103020C01500CO         USD   ...      19840        567.0
3  103020C01600CO         USD   ...      13750        567.0
4  103020C01700CO         USD   ...      22000        567.0

[5 rows x 11 columns]

### 1) Restrict the houses_2017 dataframe to only the houses that have an appraisal of no more than $200,000
Call the new dataframe afford_houses_2017

In [0]:
# Create your dataframe here.
afford_houses_2017 = houses_2017[houses_2017['TOTALAPPR'] <= 200000]

# Use .shape to determine how many houses in Davidson County match this restriction.
afford_houses_2017.shape

(92813, 11)

### 2) Further restrict the afford_houses_2017 dataframe to only the houses that have an appraisal of at least $150,000
Note: Rather than starting with houses_2017, begin with the newly created afford_houses_2017 and simply make additional restrictions.

In [0]:
# Edit your dataframe here.
afford_houses_2017 = afford_houses_2017[afford_houses_2017['TOTALAPPR'] >= 150000]

# Use .shape to determine how many houses in Davidson County match this restriction.
afford_houses_2017.shape

(43319, 11)

### 3) Combine the two restrictions in the previous cells by using the '&' symbol to represent AND in the cell below:

In [0]:
# Create your dataframe here.
afford_houses_2017 = houses_2017[(houses_2017['TOTALAPPR'] <= 200000) & (houses_2017['TOTALAPPR'] >= 150000)]

# Use .shape to determine how many houses in Davidson County match this restriction.
afford_houses_2017.shape

(43319, 11)

### 4) In the cell below, write the code that will create a dataframe (afford_houses_2017) that includes only houses with appraisals between \$150K-$200K with finished areas of at least 1800 square feet

In [0]:
# Create your dataframe here.
afford_houses_2017 = houses_2017[(houses_2017['TOTALAPPR'] <= 200000) & (houses_2017['TOTALAPPR'] >= 150000) & (houses_2017['FinishedArea']>=1800)]

# Use .head() to view the first 5 rows of your dataframe
afford_houses_2017.head()

               APN DistrictCode  ...  TOTALASSD FinishedArea
60  00200003000001         RT    ...      47450       1830.0
64     00200007400         GSD   ...      40425       2380.0
70     00300001200         GSD   ...      39500       1834.0
73     00300001700         GSD   ...      43775       2237.0
76     00300002801         GSD   ...      46675       1860.0

[5 rows x 11 columns]

### In the following cell, we will determine the number of affordable houses that are in each AddressCity.

In [0]:
# Note: We are gathering the .value_counts() of each city 
# in the 'AddressCity' column of afford_houses_2017
# and we are listing them in the order provided 
# by the unique values in the 'AddressCity' column of houses_2017

# Finally, we are naming this object affordHousesCount
# so that we can use it later

affordHousesCount = afford_houses_2017['AddressCity'].value_counts().loc[houses_2017['AddressCity'].unique()]
affordHousesCount

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike

NASHVILLE         3751.0
GOODLETTSVILLE     407.0
JOELTON             97.0
WHITES CREEK       117.0
MADISON            681.0
OLD HICKORY        194.0
ASHLAND CITY         8.0
HERMITAGE          825.0
PEGRAM               6.0
MOUNT JULIET         1.0
FRANKLIN             NaN
ANTIOCH           3191.0
BELLEVUE             NaN
BRENTWOOD            2.0
LAVERGNE             NaN
NOLENSVILLE          4.0
Name: AddressCity, dtype: float64

### 5) In the following cell, determine the number of houses that are in each AddressCity in houses_2017 (rather than afford_houses_2017).

Name this object housesCount

In [0]:
# Note: Copy the code from the previous cell and make necessary changes
housesCount =  houses_2017['AddressCity'].value_counts().loc[houses_2017['AddressCity'].unique()]
housesCount

NASHVILLE         134723
GOODLETTSVILLE      4422
JOELTON             1506
WHITES CREEK        1238
MADISON             9771
OLD HICKORY         5380
ASHLAND CITY         157
HERMITAGE          10894
PEGRAM               173
MOUNT JULIET         266
FRANKLIN              26
ANTIOCH            22770
BELLEVUE               2
BRENTWOOD           4983
LAVERGNE               3
NOLENSVILLE          800
Name: AddressCity, dtype: int64

### Note that housesCount and affordHousesCount are pandas series (soon to be columns)

Create a dictionary named Columns as we did in preparation for building the NewDataFrame above.

In [0]:
# Create a dictionary from affordHousesCount and housesCount

Columns = {'HousesCount': housesCount, 'AffordableHousesCount': affordHousesCount}

# Create a pandas dataframe built upon the dictionary named 'data' created above.
ProjectDF = pd.DataFrame(Columns)
ProjectDF

                HousesCount  AffordableHousesCount
NASHVILLE            134723                 3751.0
GOODLETTSVILLE         4422                  407.0
JOELTON                1506                   97.0
WHITES CREEK           1238                  117.0
MADISON                9771                  681.0
OLD HICKORY            5380                  194.0
ASHLAND CITY            157                    8.0
HERMITAGE             10894                  825.0
PEGRAM                  173                    6.0
MOUNT JULIET            266                    1.0
FRANKLIN                 26                    NaN
ANTIOCH               22770                 3191.0
BELLEVUE                  2                    NaN
BRENTWOOD              4983                    2.0
LAVERGNE                  3                    NaN
NOLENSVILLE             800                    4.0

### 6) In the following cell, create a new column named 'AffordPct' by dividing the 'AffordableHousesCount' column by the 'HousesCount' column and multiplying by 100.

In [0]:
ProjectDF['AffordPct'] = affordHousesCount/housesCount * 100
ProjectDF

                HousesCount  AffordableHousesCount  AffordPct
NASHVILLE            134723                 3751.0   2.784231
GOODLETTSVILLE         4422                  407.0   9.203980
JOELTON                1506                   97.0   6.440903
WHITES CREEK           1238                  117.0   9.450727
MADISON                9771                  681.0   6.969604
OLD HICKORY            5380                  194.0   3.605948
ASHLAND CITY            157                    8.0   5.095541
HERMITAGE             10894                  825.0   7.572976
PEGRAM                  173                    6.0   3.468208
MOUNT JULIET            266                    1.0   0.375940
FRANKLIN                 26                    NaN        NaN
ANTIOCH               22770                 3191.0  14.014054
BELLEVUE                  2                    NaN        NaN
BRENTWOOD              4983                    2.0   0.040136
LAVERGNE                  3                    NaN        NaN
NOLENSVILLE             800                    4.0   0.500000